Тест_ЗУП_31_КОРП/src/InformationRegisters/СведенияОРежимахРаботыФормыСотрудникаРасширенный/СведенияОРежимахРаботыФормыСотрудникаРасширенный.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СведенияОРежимахРаботыФормыСотрудникаРасширенный</name>
  <resources>
    <name>ИспользоватьНачисленияПоДоговорамВФормеСотрудника</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьВоинскийУчетВФормеСотрудника</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьЛичныеДанныеВФормеСотрудника</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>РежимРаботы</name>
    <type>
      <types>EnumRef.РежимыРаботыФормыСотрудника</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Тест_ЗУП_31_КОРП/src/InformationRegisters/НастройкиВоинскогоУчета/НастройкиВоинскогоУчета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиВоинскогоУчета</name>
  <resources>
    <name>ИспользоватьВоинскийУчет</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьБронированиеГраждан</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользуетсяТрудЛетноПодъемногоСостава</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользуетсяТрудПлавсостава</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
</mdclass:InformationRegister>

Тест_ЗУП_31_КОРП/src/Enums/РежимыРаботыФормыСотрудника/РежимыРаботыФормыСотрудника.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>РежимыРаботыФормыСотрудника</name>
  <enumValues>
    <name>Сотрудник</name>
  </enumValues>
  <enumValues>
    <name>СотрудникОформленныйПоДоговоруГПХ</name>
  </enumValues>
  <enumValues>
    <name>СотрудникОформленныйПоТрудовомуДоговору</name>
  </enumValues>
  <enumValues>
    <name>СотрудникОформленныйПоТрудовомуДоговоруИДоговоруГПХ</name>
  </enumValues>
  <enumValues>
    <name>ФизическоеЛицо</name>
  </enumValues>
</mdclass:Enum>

Тест_ЗУП_31_КОРП/src/InformationRegisters/СведенияОРежимахРаботыФормыСотрудникаРасширенный/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьНастройкиРежимов(Знач МассивРежимовРаботы) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ЗначенияФункциональныхОпций = Новый Структура;
	ЗначенияФункциональныхОпций.Вставить("ИспользоватьВоинскийУчет", Ложь);
	ЗначенияФункциональныхОпций.Вставить("ИспользоватьНачисленияПоДоговорам", Ложь);
	ЗначенияФункциональныхОпций.Вставить("ИспользоватьНачислениеЗарплаты", Ложь);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	НастройкиВоинскогоУчета.ИспользоватьВоинскийУчет
		|ПОМЕСТИТЬ ВТНастройкиВоинскогоУчета
		|ИЗ
		|	РегистрСведений.НастройкиВоинскогоУчета КАК НастройкиВоинскогоУчета
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	ИспользоватьНачислениеЗарплаты.Значение
		|		И НастройкиРасчетаЗарплатыРасширенный.ИспользоватьНачисленияПоДоговорам КАК ИспользоватьНачисленияПоДоговорам
		|ПОМЕСТИТЬ ВТНастройкиРасчетаЗарплатыРасширенный
		|ИЗ
		|	РегистрСведений.НастройкиРасчетаЗарплатыРасширенный КАК НастройкиРасчетаЗарплатыРасширенный
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Константа.ИспользоватьНачислениеЗарплаты КАК ИспользоватьНачислениеЗарплаты
		|		ПО (ИСТИНА)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МАКСИМУМ(ЕСТЬNULL(НастройкиВоинскогоУчета.ИспользоватьВоинскийУчет, ЛОЖЬ)) КАК ИспользоватьВоинскийУчет,
		|	МАКСИМУМ(ЕСТЬNULL(НастройкиРасчетаЗарплатыРасширенный.ИспользоватьНачисленияПоДоговорам, ЛОЖЬ)) КАК ИспользоватьНачисленияПоДоговорам,
		|	ИспользоватьНачислениеЗарплаты.Значение КАК ИспользоватьНачислениеЗарплаты
		|ИЗ
		|	ВТНастройкиВоинскогоУчета КАК НастройкиВоинскогоУчета
		|		ПОЛНОЕ СОЕДИНЕНИЕ ВТНастройкиРасчетаЗарплатыРасширенный КАК НастройкиРасчетаЗарплатыРасширенный
		|		ПО (ИСТИНА)
		|		ПОЛНОЕ СОЕДИНЕНИЕ Константа.ИспользоватьНачислениеЗарплаты КАК ИспользоватьНачислениеЗарплаты
		|		ПО (ИСТИНА)
		|
		|СГРУППИРОВАТЬ ПО
		|	ИспользоватьНачислениеЗарплаты.Значение";
		
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		ЗаполнитьЗначенияСвойств(ЗначенияФункциональныхОпций, Выборка);
		
	КонецЕсли; 
	
	Набор = РегистрыСведений.СведенияОРежимахРаботыФормыСотрудникаРасширенный.СоздатьНаборЗаписей();
	Набор.Прочитать();
	
	УдаляемыеЗаписи = Новый Массив;
	
	Для каждого Запись Из Набор Цикл
		
		Если НЕ ЗначениеЗаполнено(Запись.РежимРаботы) Тогда
			УдаляемыеЗаписи.Добавить(Запись);
		КонецЕсли; 
		
		ИндексРежима = МассивРежимовРаботы.Найти(Запись.РежимРаботы);
		Если ИндексРежима <> Неопределено Тогда
			МассивРежимовРаботы.Удалить(ИндексРежима);
		КонецЕсли; 
		
		ЗаполнитьЗаписьРежимаРаботыФормы(Запись, ЗначенияФункциональныхОпций);
		
	КонецЦикла;
	
	Для каждого УдаляемаяЗапись Из УдаляемыеЗаписи Цикл
		Набор.Удалить(УдаляемаяЗапись);
	КонецЦикла;
	
	Если МассивРежимовРаботы.Количество() > 0 Тогда
		
		Для каждого РежимРаботы Из МассивРежимовРаботы Цикл
			
			Запись = Набор.Добавить();
			Запись.РежимРаботы = РежимРаботы;
			
			ЗаполнитьЗаписьРежимаРаботыФормы(Запись, ЗначенияФункциональныхОпций);
			
		КонецЦикла;
		
	КонецЕсли;
	
	Набор.Записать();
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Процедура ЗаполнитьЗаписьРежимаРаботыФормы(Запись, ЗначенияФункциональныхОпций)
	
	Если Запись.РежимРаботы = Перечисления.РежимыРаботыФормыСотрудника.Сотрудник Тогда
		
		Запись.ИспользоватьНачисленияПоДоговорамВФормеСотрудника = Ложь;
		Запись.ИспользоватьВоинскийУчетВФормеСотрудника = ЗначенияФункциональныхОпций.ИспользоватьВоинскийУчет;
		Запись.ИспользоватьЛичныеДанныеВФормеСотрудника = Истина;
		
	ИначеЕсли Запись.РежимРаботы = Перечисления.РежимыРаботыФормыСотрудника.ФизическоеЛицо Тогда
		
		Запись.ИспользоватьНачисленияПоДоговорамВФормеСотрудника = Ложь;
		Запись.ИспользоватьВоинскийУчетВФормеСотрудника = Ложь;
		Запись.ИспользоватьЛичныеДанныеВФормеСотрудника = Ложь;
		
	ИначеЕсли Запись.РежимРаботы = Перечисления.РежимыРаботыФормыСотрудника.СотрудникОформленныйПоТрудовомуДоговору Тогда
		
		Запись.ИспользоватьНачисленияПоДоговорамВФормеСотрудника = Ложь;
		Запись.ИспользоватьВоинскийУчетВФормеСотрудника = ЗначенияФункциональныхОпций.ИспользоватьВоинскийУчет;
		Запись.ИспользоватьЛичныеДанныеВФормеСотрудника = Истина;
		
	ИначеЕсли Запись.РежимРаботы = Перечисления.РежимыРаботыФормыСотрудника.СотрудникОформленныйПоДоговоруГПХ Тогда
		
		Запись.ИспользоватьНачисленияПоДоговорамВФормеСотрудника = ЗначенияФункциональныхОпций.ИспользоватьНачисленияПоДоговорам;
		Запись.ИспользоватьВоинскийУчетВФормеСотрудника = Ложь;
		Запись.ИспользоватьЛичныеДанныеВФормеСотрудника = Ложь;
		
	ИначеЕсли Запись.РежимРаботы = Перечисления.РежимыРаботыФормыСотрудника.СотрудникОформленныйПоТрудовомуДоговоруИДоговоруГПХ Тогда
		
		Запись.ИспользоватьНачисленияПоДоговорамВФормеСотрудника = ЗначенияФункциональныхОпций.ИспользоватьНачисленияПоДоговорам;
		Запись.ИспользоватьВоинскийУчетВФормеСотрудника = ЗначенияФункциональныхОпций.ИспользоватьВоинскийУчет;
		Запись.ИспользоватьЛичныеДанныеВФормеСотрудника = Истина;
		
	КонецЕсли; 
		
КонецПроцедуры

#КонецОбласти

#КонецЕсли
